// Работа с %

// 1.  Даны переменные a = 10 и b = 3. Найдите остаток от деления a на b
/**
 *
 * @type {number}
 */
// const a = 10;
// const b = 3;
// const result = a % b;

// 2. Даны переменные a и b. Проверьте, что a делится без остатка на b. Если это так - выведите 'Делится' и результат деления, иначе выведите 'Делится с остатком' и остаток от деления.
/**
 *
 * @type {number}
 */
// const a = 9;
// const b = 3;
//
// if (a % b === 0) {
//     alert(`Делится, a / b = ${a / b}`);
// } else {
//     alert(`Делится с остатком ${a % b}`);
// }


